Тестовая_база_ERP_14/src/Catalogs/CRM_ЗначенияКлассификаторов/CRM_ЗначенияКлассификаторов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ЗначенияКлассификаторов</name>
  <owners>ChartOfCharacteristicTypes.CRM_Классификаторы</owners>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяШаблонаСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизит</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_ДополнительныеРеквизитыКлассификаторов</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Enums/CRM_ВидыОтображенияКлассификаторов/CRM_ВидыОтображенияКлассификаторов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыОтображенияКлассификаторов</name>
  <enumValues>
    <name>Тег</name>
  </enumValues>
  <enumValues>
    <name>Вхождение</name>
  </enumValues>
  <enumValues>
    <name>ОдиночноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйРеквизит</name>
  </enumValues>
  <enumValues>
    <name>ОтдельнымСписком</name>
  </enumValues>
  <enumValues>
    <name>ОбщимСписком</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/СпособыФормированияСегментов/СпособыФормированияСегментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыФормированияСегментов</name>
  <enumValues>
    <name>ФормироватьДинамически</name>
  </enumValues>
  <enumValues>
    <name>ПериодическиОбновлять</name>
  </enumValues>
  <enumValues>
    <name>ФормироватьВручную</name>
  </enumValues>
  <enumValues>
    <name>CRM_Анкетирование</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Catalogs/CRM_ЗначенияКлассификаторов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВидОтображения");
	РеквзитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, СтруктураРеквизитов);
	
	Если РеквзитыВладельца.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.ДополнительныйРеквизит Тогда
		ПроверяемыеРеквизиты.Добавить("ДополнительныйРеквизит");
	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	// Очистим значения данных СКД
	РеквзитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "СпособФормирования,ВидОтображения");
	Если РеквзитыВладельца.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную Тогда
		СхемаКомпоновкиДанных = Неопределено;
		ХранилищеНастроекКомпоновкиДанных = Неопределено; 	
	
	КонецЕсли;	
	
	Если Не РеквзитыВладельца.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.ДополнительныйРеквизит Тогда
		ДополнительныйРеквизит = Неопределено;
	
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИнициализироватьСправочник();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьСправочник()

	Ответственный = Пользователи.ТекущийПользователь();	

КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
